stm32-rs/stm32f4xx-hal/src/dma.rs
//! Direct Memory Access.
//!
//!
//! # Status
//! This implementation currently only provides convenience methods for configuration and clearing of interrupts. No attempt has been made
//! (yet) to provide a safe api for dealing with buffers or ongoing transfers.
//!
//! DmaStream::init is an attempt at providing compile time checking of peripheral-stream-channel-direction combinations.
//! DmaStream::init is implemented for valid combinations. [DmaStream](struct.DmaStream.html) shows a list of valid combinations.
//! You can also directly configure the DMA via the StreamX<DMA> structs but this won't give you any protection from invalid combinations.
//!
//! ## Implemented and tested
//! * ADC
//!     * Single conversion
//!     * Sequence conversions
//!     * Circular mode
//!     * Double buffer
//! ## Implemented but need further testing
//! * Features
//!     * SxCR.PFCTRL - peripheral flow control
//! * Peripherals
//!     * TIM - Timers support dozens of DMA modes. Might be a nice idea to implement the "arbitrary waveform generator" from AN4776 as a demo.
//!     * CRYP
//!     * HASH
//!     * UART
//!     * USART
//!     * SPI
//!     * I2C
//!     * DCMI
//!     * QUADSPI
//! ## Not implemented
//! * SDIO
//! * DAC
//! * AES
//! * SAI
//! * FMPI2C1
//! * DFSDM*
//! * SPDIFRX
//! * TIM6/7 - lots of devices missing DMAR register, not sure if this is an SVD issue or dma works differently on those devices.
//!
//! # Examples
//! ## ADC sequence
//! ```
//! static mut ADC_DMA_BUFFER1: [u16; 3] = [0; 3]
//! static mut ADC_DMA_BUFFER2: [u16; 3] = [0; 3]
//! fn main() {
//!     let adc_config = AdcConfig::default()
//!         .scan(Scan::Enabled)
//!         .dma(Dma::Continuous);
//!
//!     let dma_config = DmaConfig::default()
//!         .circular(true)
//!         .transfer_complete_interrupt(true)
//!         .double_buffer(true);
//!
//!     unsafe {
//!         let dma_stream = DmaStream::<DMA2, Stream0<DMA2>, Channel0, ADC1, PeripheralToMemory>::init(
//!             &mut device.DMA2,
//!             &device.ADC1,
//!             &ADC_DMA_BUFFER1 as &[u16],
//!             Some(&ADC_DMA_BUFFER2 as &[u16]),
//!             dma_config);
//!         //you can keep the returned dma_stream reference around for updating config/clearing interrupts/etc.
//!     }
//!
//!     let mut adc = Adc::adc1(device.ADC1, true, adc_config);
//!     //... configure sequence ...
//!     adc.start_conversion();
//! }
//!
//! #[interrupt]
//! fn DMA2_STREAM0() {
//!     //... get dma_stream and the dma peripheral from where we stashed them (resources if using rtfm, a static if not) ...
//!     let cb = dma_stream.current_buffer(dma);
//!     dma_stream.clear_interrupts(dma);
//!
//!     //If we didn't keep the DmaStream around, can use this instead
//!     unsafe {
//!         Stream0::<DMA2>::clear_interrupts_unsafe();
//!     }
//!
//!     info!("DMA: {:?} {:?} {:?}", cb, ADC_DMA_BUFFER1, ADC_DMA_BUFFER2);
//! }
//! ```

#![warn(missing_docs)]

use crate::{
    bb,
    stm32::{self, DMA1, DMA2, RCC},
};
use core::{
    marker::{PhantomData, Sized},
    mem,
    ops::{Deref, DerefMut},
    sync::atomic::{compiler_fence, Ordering},
};

/// Errors
#[derive(Debug, Clone, Copy, PartialEq)]
pub enum DMAError<BUF> {
    /// DMA not ready to change buffers
    NotReady(BUF),
}

/// Possible DMA's directions
#[derive(Debug, Clone, Copy, PartialEq)]
pub enum DmaDirection {
    /// Memory to Memory transfer
    MemoryToMemory,
    /// Peripheral to Memory transfer
    PeripheralToMemory,
    /// Memory to Peripheral transfer
    MemoryToPeripheral,
}

pub(crate) mod sealed {
    /// Converts value to bits for setting a register value
    pub trait Bits<T> {
        /// Returns the bit value
        fn bits(self) -> T;
    }
    pub trait Sealed {}
}
use sealed::{Bits, Sealed};

/// Trait for DMA streams types
pub trait Stream: Sealed {
    /// Number of the register stream
    fn number() -> usize;

    /// Clear all interrupts for the DMA stream
    fn clear_interrupts(&mut self);

    /// Clear transfer complete interrupt (tcif) for the DMA stream
    fn clear_transfer_complete_interrupt(&mut self);

    /// Clear half transfer interrupt (htif) for the DMA stream
    fn clear_half_transfer_interrupt(&mut self);

    /// Clear transfer error interrupt (teif) for the DMA stream
    fn clear_transfer_error_interrupt(&mut self);

    /// Clear direct mode error interrupt (dmeif) for the DMA stream
    fn clear_direct_mode_error_interrupt(&mut self);

    /// Clear fifo error interrupt (feif) for the DMA stream
    fn clear_fifo_error_interrupt(&mut self);

    /// Get transfer complete flag
    fn get_transfer_complete_flag() -> bool;

    /// Get half transfer flag
    fn get_half_transfer_flag() -> bool;

    /// Set the peripheral address (par) for the DMA stream
    fn set_peripheral_address(&mut self, value: u32);

    /// Set the memory address (m0ar) for the DMA stream
    fn set_memory_address(&mut self, value: u32);

    /// Set the double buffer address (m1ar) for the DMA stream
    fn set_memory_double_buffer_address(&mut self, value: u32);

    /// Set the number of transfers (ndt) for the DMA stream
    fn set_number_of_transfers(&mut self, value: u16);

    /// Enable the DMA stream
    ///
    /// # Safety
    ///
    /// The user must ensure that all registers are properly configured
    unsafe fn enable(&mut self);

    /// Returns the state of the DMA stream
    fn is_enabled() -> bool;

    /// Disable the DMA stream
    fn disable(&mut self);

    /// Set the channel for the (chsel) the DMA stream
    fn set_channel<C: Channel>(&mut self, channel: C);

    /// Set the priority (pl) the DMA stream
    fn set_priority(&mut self, priority: config::Priority);

    /// Set the memory size (msize) for the DMA stream
    fn set_memory_size(&mut self, size: config::TransferSize);

    /// Set the peripheral memory size (psize) for the DMA stream
    fn set_peripheral_size(&mut self, size: config::TransferSize);

    /// Enable/disable memory increment (minc) for the DMA stream
    fn set_memory_increment(&mut self, increment: bool);

    /// Enable/disable peripheral increment (pinc) for the DMA stream
    fn set_peripheral_increment(&mut self, increment: bool);

    /// Enable/disable circular mode (circ) for the DMA stream
    fn set_circular(&mut self, circular: bool);

    /// Set the direction (dir) of the DMA stream
    fn set_direction<D: Direction>(&mut self, direction: D);

    /// Convenience method to configure the 4 common interrupts for the DMA stream
    fn set_interrupts_enable(
        &mut self,
        transfer_complete: bool,
        half_transfer: bool,
        transfer_error: bool,
        direct_mode_error: bool,
    );

    /// Enable/disable the transfer complete interrupt (tcie) of the DMA stream
    fn set_transfer_complete_interrupt_enable(&mut self, transfer_complete_interrupt: bool);

    /// Enable/disable the half transfer interrupt (htie) of the DMA stream
    fn set_half_transfer_interrupt_enable(&mut self, half_transfer_interrupt: bool);

    /// Enable/disable the transfer error interrupt (teie) of the DMA stream
    fn set_transfer_error_interrupt_enable(&mut self, transfer_error_interrupt: bool);

    /// Enable/disable the direct mode error interrupt (dmeie) of the DMA stream
    fn set_direct_mode_error_interrupt_enable(&mut self, direct_mode_error_interrupt: bool);

    /// Enable/disable the fifo error interrupt (feie) of the DMA stream
    fn set_fifo_error_interrupt_enable(&mut self, fifo_error_interrupt: bool);

    /// Enable/disable the double buffer (dbm) of the DMA stream
    fn set_double_buffer(&mut self, double_buffer: bool);

    /// Set the fifo threshold (fcr.fth) of the DMA stream
    fn set_fifo_threshold(&mut self, fifo_threshold: config::FifoThreshold);

    /// Enable/disable the fifo (dmdis) of the DMA stream
    fn set_fifo_enable(&mut self, fifo_enable: bool);

    /// Set memory burst mode (mburst) of the DMA stream
    fn set_memory_burst(&mut self, memory_burst: config::BurstMode);

    /// Set peripheral burst mode (pburst) of the DMA stream
    fn set_peripheral_burst(&mut self, peripheral_burst: config::BurstMode);

    /// Get the current fifo level (fs) of the DMA stream
    fn fifo_level() -> FifoLevel;

    /// Set the flow controller (pfctrl) of the DMA stream
    fn set_flow_controller(&mut self, flow_controller: config::FlowController);

