stm32-rs/stm32f4xx-hal/src/dma.rs
    /// Get which buffer is currently in use
    fn current_buffer() -> CurrentBuffer;
}

/// DMA direction
pub trait Direction: Bits<u8> {
    /// Creates a new instance of the type
    fn new() -> Self;

    /// Returns the `DmaDirection` of the type
    fn direction() -> DmaDirection;
}

/// DMA from a peripheral to a memory location
#[derive(Debug, Clone, Copy)]
pub struct PeripheralToMemory;
impl Bits<u8> for PeripheralToMemory {
    #[inline]
    fn bits(self) -> u8 {
        0
    }
}
impl Direction for PeripheralToMemory {
    fn new() -> Self {
        PeripheralToMemory
    }
    #[inline]
    fn direction() -> DmaDirection {
        DmaDirection::PeripheralToMemory
    }
}

/// DMA from one memory location to another memory location
#[derive(Debug, Clone, Copy)]
pub struct MemoryToMemory<T> {
    _data: PhantomData<T>,
}

impl<T> Bits<u8> for MemoryToMemory<T> {
    #[inline]
    fn bits(self) -> u8 {
        2
    }
}

impl<T> Direction for MemoryToMemory<T> {
    fn new() -> Self {
        Self { _data: PhantomData }
    }
    #[inline]
    fn direction() -> DmaDirection {
        DmaDirection::MemoryToMemory
    }
}

/// DMA from a memory location to a peripheral
#[derive(Debug, Clone, Copy)]
pub struct MemoryToPeripheral;
impl Bits<u8> for MemoryToPeripheral {
    #[inline]
    fn bits(self) -> u8 {
        1
    }
}
impl Direction for MemoryToPeripheral {
    fn new() -> Self {
        MemoryToPeripheral
    }
    fn direction() -> DmaDirection {
        DmaDirection::MemoryToPeripheral
    }
}

/// Get an address and memory size the DMA can use
pub trait PeriAddress: Sealed {
    /// Memory size of the peripheral
    type MemSize;

    /// Returns the address to be used by the DMA stream
    fn address(&self) -> u32;
}

impl Sealed for MemoryToMemory<u8> {}
impl Sealed for MemoryToMemory<u16> {}
impl Sealed for MemoryToMemory<u32> {}

impl PeriAddress for MemoryToMemory<u8> {
    fn address(&self) -> u32 {
        unimplemented!()
    }
    type MemSize = u8;
}

impl PeriAddress for MemoryToMemory<u16> {
    fn address(&self) -> u32 {
        unimplemented!()
    }
    type MemSize = u16;
}

impl PeriAddress for MemoryToMemory<u32> {
    fn address(&self) -> u32 {
        unimplemented!()
    }
    type MemSize = u32;
}

/// Convenience macro for implementing addresses on peripherals
macro_rules! address {
    ($(($peripheral:ty, $register:ident, $size: ty)),+ $(,)*) => {
        $(
            impl Sealed for $peripheral {}

            impl PeriAddress for $peripheral {
                #[inline]
                fn address(&self) -> u32 {
                    &self.$register as *const _ as u32
                }

                type MemSize = $size;
            }
        )+
    };
}

macro_rules! tim_channels {
    ($(($name:ident, $register:ident)),+ $(,)*) => {
        $(
            /// Wrapper type that indicates which register of the contained timer to use for DMA
            pub struct $name<T> (T);
            impl<T> Deref for $name<T> {
                type Target = T;
                #[inline]
                fn deref(&self) -> &T {
                    &self.0
                }
            }
        )+
    };
}

tim_channels!(
    (CCR1, ccr1),
    (CCR2, ccr2),
    (CCR3, ccr3),
    (CCR4, ccr4),
    (DMAR, dmar),
    (ARR, arr),
);

/// How full the DMA stream's fifo is
#[derive(Debug, Clone, Copy)]
pub enum FifoLevel {
    /// 0 < fifo_level < 1/4
    GtZeroLtQuarter,
    /// 1/4 <= fifo_level < 1/2
    GteQuarterLtHalf,
    /// 1/2 <= fifo_level < 3/4
    GteHalfLtThreeQuarter,
    /// 3/4 <= fifo_level < full
    GteThreeQuarterLtFull,
    /// Fifo is empty
    Empty,
    /// Fifo is full
    Full,
}

impl From<u8> for FifoLevel {
    fn from(value: u8) -> Self {
        match value {
            0 => FifoLevel::GtZeroLtQuarter,
            1 => FifoLevel::GteQuarterLtHalf,
            2 => FifoLevel::GteHalfLtThreeQuarter,
            3 => FifoLevel::GteThreeQuarterLtFull,
            4 => FifoLevel::Empty,
            5 => FifoLevel::Full,
            _ => unimplemented!(),
        }
    }
}

/// Which DMA buffer is in use
#[derive(Debug, Clone, Copy, PartialEq)]
pub enum CurrentBuffer {
    /// The first buffer (m0ar) is in use
    FirstBuffer,
    /// The second buffer (m1ar) is in use
    DoubleBuffer,
}

/// Stream 0 on the DMA controller
pub struct Stream0<DMA> {
    _dma: PhantomData<DMA>,
}
/// Stream 1 on the DMA controller. See Stream0 for more info.
pub struct Stream1<DMA> {
    _dma: PhantomData<DMA>,
}
/// Stream 2 on the DMA controller. See Stream0 for more info.
pub struct Stream2<DMA> {
    _dma: PhantomData<DMA>,
}
/// Stream 3 on the DMA controller. See Stream0 for more info.
pub struct Stream3<DMA> {
    _dma: PhantomData<DMA>,
}
/// Stream 4 on the DMA controller. See Stream0 for more info.
pub struct Stream4<DMA> {
    _dma: PhantomData<DMA>,
}
/// Stream 5 on the DMA controller. See Stream0 for more info.
pub struct Stream5<DMA> {
    _dma: PhantomData<DMA>,
}
/// Stream 6 on the DMA controller. See Stream0 for more info.
pub struct Stream6<DMA> {
    _dma: PhantomData<DMA>,
}
/// Stream 7 on the DMA controller. See Stream0 for more info.
pub struct Stream7<DMA> {
    _dma: PhantomData<DMA>,
}

impl<DMA> Sealed for Stream0<DMA> {}
impl<DMA> Sealed for Stream1<DMA> {}
impl<DMA> Sealed for Stream2<DMA> {}
impl<DMA> Sealed for Stream3<DMA> {}
impl<DMA> Sealed for Stream4<DMA> {}
impl<DMA> Sealed for Stream5<DMA> {}
impl<DMA> Sealed for Stream6<DMA> {}
impl<DMA> Sealed for Stream7<DMA> {}

impl Sealed for DMA1 {}
impl Sealed for DMA2 {}

#[cfg(not(any(feature = "stm32f411", feature = "stm32f413", feature = "stm32f423")))]
/// Type alias to a DMA RegisterBlock
pub type DMARegisterBlock = stm32::dma2::RegisterBlock;

#[cfg(any(feature = "stm32f411", feature = "stm32f413", feature = "stm32f423"))]
/// Type alias to a DMA RegisterBlock
pub type DMARegisterBlock = stm32::dma1::RegisterBlock;

/// Trait that represents an instance of a DMA peripheral
pub trait Instace: Deref<Target = DMARegisterBlock> + Sealed {
    /// Gives a pointer to the RegisterBlock
    fn ptr() -> *const DMARegisterBlock;
}

