stm32-rs/stm32f4xx-hal/src/dma.rs
impl Instace for DMA1 {
    #[inline]
    fn ptr() -> *const DMARegisterBlock {
        DMA1::ptr()
    }
}

impl Instace for DMA2 {
    #[inline]
    fn ptr() -> *const DMARegisterBlock {
        DMA1::ptr()
    }
}

/// Things that implement this can have their RCC enabled
trait RccEnable {
    fn rcc_enable(&self);
}

impl RccEnable for stm32::DMA1 {
    fn rcc_enable(&self) {
        unsafe {
            //NOTE(unsafe) this reference will only be used for atomic writes with no side effects
            let rcc = &(*RCC::ptr());
            // Enable and reset the timer peripheral
            bb::set(&rcc.ahb1enr, 21);
            bb::set(&rcc.ahb1rstr, 21);
            bb::clear(&rcc.ahb1rstr, 21);
        }
    }
}

impl RccEnable for stm32::DMA2 {
    fn rcc_enable(&self) {
        unsafe {
            //NOTE(unsafe) this reference will only be used for atomic writes with no side effects
            let rcc = &(*RCC::ptr());
            // Enable and reset the timer peripheral
            bb::set(&rcc.ahb1enr, 22);
            bb::set(&rcc.ahb1rstr, 22);
            bb::clear(&rcc.ahb1rstr, 22);
        }
    }
}

/// Extension trait to split the DMA peripheral
pub trait DMAExt: Sized {
    /// Splits the DMA into channels
    fn split(
        self,
    ) -> (
        Stream0<Self>,
        Stream1<Self>,
        Stream2<Self>,
        Stream3<Self>,
        Stream4<Self>,
        Stream5<Self>,
        Stream6<Self>,
        Stream7<Self>,
    );
}

impl DMAExt for DMA1 {
    fn split(
        self,
    ) -> (
        Stream0<Self>,
        Stream1<Self>,
        Stream2<Self>,
        Stream3<Self>,
        Stream4<Self>,
        Stream5<Self>,
        Stream6<Self>,
        Stream7<Self>,
    ) {
        self.rcc_enable();
        (
            Stream0 { _dma: PhantomData },
            Stream1 { _dma: PhantomData },
            Stream2 { _dma: PhantomData },
            Stream3 { _dma: PhantomData },
            Stream4 { _dma: PhantomData },
            Stream5 { _dma: PhantomData },
            Stream6 { _dma: PhantomData },
            Stream7 { _dma: PhantomData },
        )
    }
}

impl DMAExt for DMA2 {
    fn split(
        self,
    ) -> (
        Stream0<Self>,
        Stream1<Self>,
        Stream2<Self>,
        Stream3<Self>,
        Stream4<Self>,
        Stream5<Self>,
        Stream6<Self>,
        Stream7<Self>,
    ) {
        self.rcc_enable();
        (
            Stream0 { _dma: PhantomData },
            Stream1 { _dma: PhantomData },
            Stream2 { _dma: PhantomData },
            Stream3 { _dma: PhantomData },
            Stream4 { _dma: PhantomData },
            Stream5 { _dma: PhantomData },
            Stream6 { _dma: PhantomData },
            Stream7 { _dma: PhantomData },
        )
    }
}

/// Macro that creates a struct representing a stream on either DMA controller
/// The implementation does the heavy lifting of mapping to the right fields on the stream
macro_rules! dma_stream {
    ($(($name:ident, $number:expr ,$ifcr:ident, $tcif:ident, $htif:ident, $teif:ident, $dmeif:ident,
        $feif:ident, $isr:ident, $tcisr:ident, $htisr:ident)),+ $(,)*) => {
        $(
            #[allow(dead_code)]
            impl<I: Instace> Stream for $name<I> {

                #[inline]
                fn number() -> usize {
                    $number
                }

                #[inline]
                fn clear_interrupts(&mut self) {
                    //NOTE(unsafe) Atomic write with no side-effects and we only access the bits
                    // that belongs to the StreamX
                    let dma = unsafe { &*I::ptr() };
                    dma.$ifcr.write(|w| w
                        .$tcif().set_bit() //Clear transfer complete interrupt flag
                        .$htif().set_bit() //Clear half transfer interrupt flag
                        .$teif().set_bit() //Clear transfer error interrupt flag
                        .$dmeif().set_bit() //Clear direct mode error interrupt flag
                        .$feif().set_bit() //Clear fifo error interrupt flag
                    );
                }

                #[inline]
                fn clear_transfer_complete_interrupt(&mut self) {
                    //NOTE(unsafe) Atomic write with no side-effects and we only access the bits
                    // that belongs to the StreamX
                    let dma = unsafe { &*I::ptr() };
                    dma.$ifcr.write(|w| w.$tcif().set_bit());
                }

                #[inline]
                fn clear_half_transfer_interrupt(&mut self) {
                    //NOTE(unsafe) Atomic write with no side-effects and we only access the bits
                    // that belongs to the StreamX
                    let dma = unsafe { &*I::ptr() };
                    dma.$ifcr.write(|w| w.$htif().set_bit());
                }

                #[inline]
                fn clear_transfer_error_interrupt(&mut self) {
                    //NOTE(unsafe) Atomic write with no side-effects and we only access the bits
                    // that belongs to the StreamX
                    let dma = unsafe { &*I::ptr() };
                    dma.$ifcr.write(|w| w.$teif().set_bit());
                }

                #[inline]
                fn clear_direct_mode_error_interrupt(&mut self) {
                    //NOTE(unsafe) Atomic write with no side-effects and we only access the bits
                    // that belongs to the StreamX
                    let dma = unsafe { &*I::ptr() };
                    dma.$ifcr.write(|w| w.$dmeif().set_bit());
                }

                #[inline]
                fn clear_fifo_error_interrupt(&mut self) {
                    //NOTE(unsafe) Atomic write with no side-effects and we only access the bits
                    // that belongs to the StreamX
                    let dma = unsafe { &*I::ptr() };
                    dma.$ifcr.write(|w| w.$feif().set_bit());
                }

                #[inline]
                fn get_transfer_complete_flag() -> bool {
                    //NOTE(unsafe) Atomic read with no side effects
                    let dma = unsafe { &*I::ptr() };
                    dma.$isr.read().$tcisr().bit_is_set()
                }

