stm32-rs/stm32f4xx-hal/src/dma.rs
                #[inline]
                fn get_half_transfer_flag() -> bool {
                    //NOTE(unsafe) Atomic read with no side effects
                    let dma = unsafe { &*I::ptr() };
                    dma.$isr.read().$htisr().bit_is_set()
                }

                #[inline]
                fn set_peripheral_address(&mut self, value: u32) {
                    //NOTE(unsafe) We only access the registers that belongs to the StreamX
                    let dma = unsafe { &*I::ptr() };
                    dma.st[Self::number()].par.write(|w| w.pa().bits(value));
                }

                #[inline]
                fn set_memory_address(&mut self, value: u32) {
                    //NOTE(unsafe) We only access the registers that belongs to the StreamX
                    let dma = unsafe { &*I::ptr() };
                    dma.st[Self::number()].m0ar.write(|w| w.m0a().bits(value));
                }

                #[inline]
                fn set_memory_double_buffer_address(&mut self, value: u32) {
                    //NOTE(unsafe) We only access the registers that belongs to the StreamX
                    let dma = unsafe { &*I::ptr() };
                    dma.st[Self::number()].m1ar.write(|w| w.m1a().bits(value));
                }

                #[inline]
                fn set_number_of_transfers(&mut self, value: u16) {
                    //NOTE(unsafe) We only access the registers that belongs to the StreamX
                    let dma = unsafe { &*I::ptr() };
                    dma.st[Self::number()].ndtr.write(|w| w.ndt().bits(value));
                }

                #[inline]
                unsafe fn enable(&mut self) {
                    //NOTE(unsafe) We only access the registers that belongs to the StreamX
                    let dma = &*I::ptr();
                    dma.st[Self::number()].cr.modify(|_, w| w.en().set_bit());
                }

                #[inline]
                fn is_enabled() -> bool {
                    //NOTE(unsafe) Atomic read with no side effects
                    let dma = unsafe { &*I::ptr() };
                    dma.st[Self::number()].cr.read().en().bit_is_set()
                }

                #[inline]
                fn disable(&mut self) {
                    //NOTE(unsafe) We only access the registers that belongs to the StreamX
                    let dma = unsafe { &*I::ptr() };
                    dma.st[Self::number()].cr.modify(|_, w| w.en().clear_bit());
                }

                #[inline]
                fn set_channel<C: Channel>(&mut self, channel: C) {
                    //NOTE(unsafe) We only access the registers that belongs to the StreamX
                    let dma = unsafe { &*I::ptr() };
                    //Some device crates have this field unsafe, others don't.
                    #[allow(unused_unsafe)]
                    dma.st[Self::number()].cr.modify(|_, w| unsafe { w.chsel().bits(channel.bits()) });
                }

                #[inline]
                fn set_priority(&mut self, priority: config::Priority) {
                    //NOTE(unsafe) We only access the registers that belongs to the StreamX
                    let dma = unsafe { &*I::ptr() };
                    dma.st[Self::number()].cr.modify(|_, w| w.pl().bits(priority.bits()));
                }

                #[inline]
                fn set_memory_size(&mut self, size: config::TransferSize) {
                    //NOTE(unsafe) We only access the registers that belongs to the StreamX
                    let dma = unsafe { &*I::ptr() };
                    dma.st[Self::number()].cr.modify(|_, w| unsafe { w.msize().bits(size.bits()) });
                }

                #[inline]
                fn set_peripheral_size(&mut self, size: config::TransferSize) {
                    //NOTE(unsafe) We only access the registers that belongs to the StreamX
                    let dma = unsafe { &*I::ptr() };
                    dma.st[Self::number()].cr.modify(|_, w| unsafe { w.psize().bits(size.bits()) });
                }

                #[inline]
                fn set_memory_increment(&mut self, increment: bool) {
                    //NOTE(unsafe) We only access the registers that belongs to the StreamX
                    let dma = unsafe { &*I::ptr() };
                    dma.st[Self::number()].cr.modify(|_, w| w.minc().bit(increment));
                }

                #[inline]
                fn set_peripheral_increment(&mut self, increment: bool) {
                    //NOTE(unsafe) We only access the registers that belongs to the StreamX
                    let dma = unsafe { &*I::ptr() };
                    dma.st[Self::number()].cr.modify(|_, w| w.pinc().bit(increment));
                }

                #[inline]
                fn set_circular(&mut self, circular: bool) {
                    //NOTE(unsafe) We only access the registers that belongs to the StreamX
                    let dma = unsafe { &*I::ptr() };
                    dma.st[Self::number()].cr.modify(|_, w| w.circ().bit(circular));
                }

                #[inline]
                fn set_direction<D: Direction>(&mut self, direction: D) {
                    //NOTE(unsafe) We only access the registers that belongs to the StreamX
                    let dma = unsafe { &*I::ptr() };
                    dma.st[Self::number()].cr.modify(|_, w| unsafe { w.dir().bits(direction.bits()) });
                }

                #[inline]
                fn set_interrupts_enable(&mut self, transfer_complete: bool, half_transfer: bool, transfer_error: bool, direct_mode_error: bool) {
                    //NOTE(unsafe) We only access the registers that belongs to the StreamX
                    let dma = unsafe { &*I::ptr() };
                    dma.st[Self::number()].cr.modify(|_, w| w
                        .tcie().bit(transfer_complete)
                        .htie().bit(half_transfer)
                        .teie().bit(transfer_error)
                        .dmeie().bit(direct_mode_error)
                    );
                }

