stm32-rs/stm32f4xx-hal/src/dma.rs
/* DFSDM1 appears to be missing from SVD
#[cfg(any(
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
))]
dma_map!(
    (stm32::DMA2, Stream0, Channel7, stm32::DFSDM1, PeripheralToMemory), //DFSDM1_FLT0
    (stm32::DMA2, Stream1, Channel3, stm32::DFSDM1, PeripheralToMemory), //DFSDM1_FLT1
    (stm32::DMA2, Stream4, Channel3, stm32::DFSDM1, PeripheralToMemory), //DFSDM1_FLT1
    (stm32::DMA2, Stream6, Channel3, stm32::DFSDM1, PeripheralToMemory), //DFSDM1_FLT0:DMA_CHANNEL_3
);
#[cfg(any(
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
))]
address!(
    (stm32::DFSDM1, dr),
);
*/

#[cfg(any(
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (Stream7<DMA2>, Channel3, stm32::QUADSPI, MemoryToPeripheral), //QUADSPI
    (Stream7<DMA2>, Channel3, stm32::QUADSPI, PeripheralToMemory), //QUADSPI
);

#[cfg(any(
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!((stm32::QUADSPI, dr, u32),);

#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (Stream0<DMA1>, Channel5, stm32::UART8, MemoryToPeripheral), //UART8_TX
    (Stream1<DMA1>, Channel5, stm32::UART7, MemoryToPeripheral), //UART7_TX
    (Stream3<DMA1>, Channel5, stm32::UART7, PeripheralToMemory), //UART7_RX
    (Stream6<DMA1>, Channel5, stm32::UART8, PeripheralToMemory), //UART8_RX
);

#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!((stm32::UART7, dr, u8), (stm32::UART8, dr, u8),);

#[cfg(any(feature = "stm32f413", feature = "stm32f423",))]
dma_map!(
    (Stream7<DMA1>, Channel8, stm32::UART5, MemoryToPeripheral), //UART5_TX
    (Stream0<DMA2>, Channel1, stm32::UART9, MemoryToPeripheral), //UART9_TX
    (Stream0<DMA2>, Channel5, stm32::UART10, PeripheralToMemory), //UART10_RX
    (Stream3<DMA2>, Channel9, stm32::UART10, PeripheralToMemory), //UART10_RX:DMA_CHANNEL_9
    (Stream5<DMA2>, Channel9, stm32::UART10, MemoryToPeripheral), //UART10_TX
    (Stream7<DMA2>, Channel0, stm32::UART9, PeripheralToMemory), //UART9_RX
    (Stream7<DMA2>, Channel6, stm32::UART10, MemoryToPeripheral), //UART10_TX:DMA_CHANNEL_6
                                                                 //(stm32::DMA2, Stream0, Channel8, stm32::DFSDM2, PeripheralToMemory), //DFSDM2_FLT0
                                                                 //(stm32::DMA2, Stream1, Channel8, stm32::DFSDM2, PeripheralToMemory), //DFSDM2_FLT1
                                                                 //(stm32::DMA2, Stream2, Channel8, stm32::DFSDM2, PeripheralToMemory), //DFSDM2_FLT2
                                                                 //(stm32::DMA2, Stream3, Channel8, stm32::DFSDM2, PeripheralToMemory), //DFSDM2_FLT3
                                                                 //(stm32::DMA2, Stream4, Channel8, stm32::DFSDM2, PeripheralToMemory), //DFSDM2_FLT0
                                                                 //(stm32::DMA2, Stream5, Channel8, stm32::DFSDM2, PeripheralToMemory), //DFSDM2_FLT1
                                                                 //(stm32::DMA2, Stream6, Channel8, stm32::DFSDM2, PeripheralToMemory), //DFSDM2_FLT2
                                                                 //(stm32::DMA2, Stream7, Channel8, stm32::DFSDM2, PeripheralToMemory), //DFSDM2_FLT3
                                                                 //(stm32::DMA2, Stream6, Channel2, IN<stm32::AES>, MemoryToPeripheral), //AES_IN
                                                                 //(stm32::DMA2, Stream5, Channel2, OUT<stm32::AES>, PeripheralToMemory), //AES_OUT
);

#[cfg(any(feature = "stm32f413", feature = "stm32f423",))]
address!(
    //(IN<stm32::AES>, dinr),
    //(OUT<stm32::AES>, doutr),
    (stm32::UART9, dr, u8),
    (stm32::UART10, dr, u8),
);

/* Not sure how SAI works
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (stm32::DMA2, Stream1, Channel0, stm32::SAI, MemoryToPeripheral), //SAI1_A
    (stm32::DMA2, Stream1, Channel0, stm32::SAI, PeripheralToMemory), //SAI1_A
    (stm32::DMA2, Stream3, Channel0, stm32::SAI, MemoryToPeripheral), //SAI1_A
    (stm32::DMA2, Stream3, Channel0, stm32::SAI, PeripheralToMemory), //SAI1_A
    (stm32::DMA2, Stream4, Channel1, stm32::SAI, MemoryToPeripheral), //SAI1_B
    (stm32::DMA2, Stream4, Channel1, stm32::SAI, PeripheralToMemory), //SAI1_B
    (stm32::DMA2, Stream5, Channel0, stm32::SAI, MemoryToPeripheral), //SAI1_B:DMA_CHANNEL_0
    (stm32::DMA2, Stream5, Channel0, stm32::SAI, PeripheralToMemory), //SAI1_B:DMA_CHANNEL_0
);

#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!(
    (stm32::SAI, dr),
);
*/

#[cfg(any(
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (Stream5<DMA2>, Channel1, stm32::SPI6, MemoryToPeripheral), //SPI6_TX
    (Stream6<DMA2>, Channel1, stm32::SPI6, PeripheralToMemory), //SPI6_RX
);

#[cfg(any(
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!((stm32::SPI6, dr, u8),);

/*
#[cfg(any(
    feature = "stm32f446",
))]
dma_map!(
    (stm32::DMA1, Stream1, Channel0, stm32::SPDIFRX, PeripheralToMemory), //SPDIF_RX_DT
    (stm32::DMA1, Stream2, Channel2, stm32::FMPI2C1, PeripheralToMemory), //FMPI2C1_RX
    (stm32::DMA1, Stream5, Channel2, stm32::FMPI2C1, MemoryToPeripheral), //FMPI2C1_TX
    (stm32::DMA1, Stream6, Channel0, stm32::SPDIFRX, PeripheralToMemory), //SPDIF_RX_CS
    (stm32::DMA2, Stream4, Channel3, stm32::SAI2, MemoryToPeripheral), //SAI2_A
    (stm32::DMA2, Stream4, Channel3, stm32::SAI2, PeripheralToMemory), //SAI2_A
    (stm32::DMA2, Stream6, Channel3, stm32::SAI2, MemoryToPeripheral), //SAI2_B
    (stm32::DMA2, Stream6, Channel3, stm32::SAI2, PeripheralToMemory), //SAI2_B
    (stm32::DMA2, Stream7, Channel0, stm32::SAI2, MemoryToPeripheral), //SAI2_B:DMA_CHANNEL_0
    (stm32::DMA2, Stream7, Channel0, stm32::SAI2, PeripheralToMemory), //SAI2_B:DMA_CHANNEL_0
);
#[cfg(any(
    feature = "stm32f446",
))]
address!(
    (stm32::SPDIFRX, ??),
    (stm32::FMPI2C1, ??),
    (stm32::SAI2, ??),
);
*/
